In [0]:
import pandas as pd

In [93]:
data = pd.read_csv('titanic.csv')
data.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [19]:
guy=0
women=0
for index, row in data.iterrows(): #метод перебора (можно как по строкам, так и по столбцам)
    row[4]=str(row[4])
    if row[4]== "male":
        guy=guy+1
    else:
        women=women+1
print(guy,',',women)

577 , 314

In [27]:
data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [110]:
surv_counts = data['Survived'].value_counts()
 
surv_percent = 100.0 * surv_counts[1] / surv_counts.sum()
 
print(round(surv_percent))

38.0

In [111]:

data.groupby('Pclass').count()

        PassengerId  Survived  Name  Sex  ...  Ticket  Fare  Cabin  Embarked
Pclass                                    ...
1               216       216   216  216  ...     216   216    176       214
2               184       184   184  184  ...     184   184     16       184
3               491       491   491  491  ...     491   491     12       491

[3 rows x 11 columns]

In [112]:
pclass_counts = data['Pclass'].value_counts()
 
pclass_percent = 100.0 * pclass_counts[1] / pclass_counts.sum()

print(round(pclass_percent))

24.0

In [104]:
ages = data.Age.dropna()
ages.mean(), ages.median()

(29.69911764705882, 28.0)

In [105]:
data.SibSp.corr(data.Parch)

0.41483769862015557

In [121]:
import re
def clean_name(name):
 
    # Первое слово до запятой - фамилия
    s = re.search('^[^,]+, (.*)', name)
    if s:
        name = s.group(1)
 
    # Если есть скобки - то имя пассажира в них
    s = re.search('\(([^)]+)\)', name)
    if s:
        name = s.group(1)
    # Удаляем обращения
    name = re.sub('(Miss\. |Mrs\. |Ms\. )', '', name)
    # Берем первое оставшееся слово и удаляем кавычки
    name = name.split(' ')[0].replace('"', '')
    return name
 
names = data[data['Sex'] == 'female']['Name'].map(clean_name)
name_counts = names.value_counts()
 
print(name_counts.head(1).index.values[0])

Anna